results/springboot/r6id.xlarge/wrk2.log
===== Spring Boot Benchmark (wrk) =====
Instance Type: r6id.xlarge
Spring Boot Host: springboot-server-r6id-xlarge

--- Warm-up Phase (30s) ---
Warm-up complete

--- Main Page - 2 threads, 50 connections, 60s ---
Running 1m test @ http://springboot-server-r6id-xlarge:8080/
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05ms  543.19us  40.87ms   95.12%
    Req/Sec    23.80k     0.88k   26.02k    68.08%
  Latency Distribution
     50%    0.98ms
     75%    1.12ms
     90%    1.31ms
     99%    2.18ms
  2841324 requests in 1.00m, 379.87MB read
Requests/sec:  47354.11
Transfer/sec:      6.33MB

--- Main Page - 2 threads, 100 connections, 60s ---
Running 1m test @ http://springboot-server-r6id-xlarge:8080/
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.81ms  478.06us  21.28ms   76.98%
    Req/Sec    27.22k     0.89k   29.80k    69.08%
  Latency Distribution
     50%    1.75ms
     75%    2.01ms
     90%    2.36ms
     99%    3.28ms
  3250609 requests in 1.00m, 434.59MB read
Requests/sec:  54094.41
Transfer/sec:      7.23MB

--- High Load - 2 threads, 200 connections, 30s ---
Running 30s test @ http://springboot-server-r6id-xlarge:8080/
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.50ms    0.88ms  30.41ms   77.39%
    Req/Sec    28.29k     0.97k   30.71k    71.07%
  Latency Distribution
     50%    3.43ms
     75%    3.84ms
     90%    4.48ms
     99%    6.09ms
  1683325 requests in 30.09s, 225.05MB read
Requests/sec:  55949.21
Transfer/sec:      7.48MB

===== Spring Boot Benchmark Complete =====